# Relatório de Análise I

## Importando a base de dados

In [1]:
import pandas as pd

In [2]:
dados = pd.read_csv('Dados/aluguel.csv', sep = ';')

In [3]:
# Trazer as cinco primeiras linhas
dados.head()

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000.0,NaN,NaN
2,Conjunto Comercial/Sala,Barra da Tijuca,0,4,0,150,5200.0,4020.0,1111.0
3,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0
4,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,NaN

## Exercício Aula 2

In [4]:
data = [['Fulano', 12, 7.0, True],
        ['Sicrano', 15, 3.5, False], 
        ['Beltrano', 18, 9.3, True]]

In [5]:
dados = pd.DataFrame(data, 
        columns = ['Aluno', 'Idade', 'Nota', 'Aprovado'])

In [6]:
dados

      Aluno  Idade  Nota  Aprovado
0    Fulano     12   7.0      True
1   Sicrano     15   3.5     False
2  Beltrano     18   9.3      True

In [7]:
tipos_de_dados = pd.DataFrame(dados.dtypes, columns = ['Tipos de Dados'])
tipos_de_dados.columns.name = 'Variáveis'
tipos_de_dados

Variáveis Tipos de Dados
Aluno             object
Idade              int64
Nota             float64
Aprovado            bool

## Exercícios Aula 3

In [11]:
dados = pd.read_csv('Dados/aluguel.csv', sep = ';')
dados.head()

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000.0,NaN,NaN
2,Conjunto Comercial/Sala,Barra da Tijuca,0,4,0,150,5200.0,4020.0,1111.0
3,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0
4,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,NaN

In [13]:
tipo_de_imovel = dados['Tipo']
tipo_de_imovel

0                      Quitinete
1                           Casa
2        Conjunto Comercial/Sala
3                    Apartamento
4                    Apartamento
                  ...
32955                  Quitinete
32956                Apartamento
32957                Apartamento
32958                Apartamento
32959    Conjunto Comercial/Sala
Name: Tipo, Length: 32960, dtype: object

In [14]:
type(tipo_de_imovel)

pandas.core.series.Series

In [31]:
tipos = tipo_de_imovel.drop_duplicates()
tipos

0                          Quitinete
1                               Casa
2            Conjunto Comercial/Sala
3                        Apartamento
7                 Casa de Condomínio
16                    Prédio Inteiro
17                              Flat
29                        Loja/Salão
80           Galpão/Depósito/Armazém
83                    Casa Comercial
117                     Casa de Vila
159                   Terreno Padrão
207                      Box/Garagem
347                             Loft
589      Loja Shopping/ Ct Comercial
2157                         Chácara
3354           Loteamento/Condomínio
4379                           Sítio
4721                   Pousada/Chalé
6983                          Studio
9687                           Hotel
23614                      Indústria
Name: Tipo, dtype: object

In [17]:
type(tipos)

pandas.core.series.Series

In [32]:
tipos = tipos.sort_values()

In [33]:
tipos

3                        Apartamento
207                      Box/Garagem
1                               Casa
83                    Casa Comercial
7                 Casa de Condomínio
117                     Casa de Vila
2157                         Chácara
2            Conjunto Comercial/Sala
17                              Flat
80           Galpão/Depósito/Armazém
9687                           Hotel
23614                      Indústria
347                             Loft
589      Loja Shopping/ Ct Comercial
29                        Loja/Salão
3354           Loteamento/Condomínio
4721                   Pousada/Chalé
16                    Prédio Inteiro
0                          Quitinete
6983                          Studio
4379                           Sítio
159                   Terreno Padrão
Name: Tipo, dtype: object

In [34]:
tipos = pd.DataFrame(tipos)

In [35]:
tipos

                              Tipo
3                      Apartamento
207                    Box/Garagem
1                             Casa
83                  Casa Comercial
7               Casa de Condomínio
117                   Casa de Vila
2157                       Chácara
2          Conjunto Comercial/Sala
17                            Flat
80         Galpão/Depósito/Armazém
9687                         Hotel
23614                    Indústria
347                           Loft
589    Loja Shopping/ Ct Comercial
29                      Loja/Salão
3354         Loteamento/Condomínio
4721                 Pousada/Chalé
16                  Prédio Inteiro
0                        Quitinete
6983                        Studio
4379                         Sítio
159                 Terreno Padrão

In [40]:
tipos.index = range(len(tipos))
tipos.columns.name = 'Id'

In [41]:
tipos

Id                         Tipo
0                   Apartamento
1                   Box/Garagem
2                          Casa
3                Casa Comercial
4            Casa de Condomínio
5                  Casa de Vila
6                       Chácara
7       Conjunto Comercial/Sala
8                          Flat
9       Galpão/Depósito/Armazém
10                        Hotel
11                    Indústria
12                         Loft
13  Loja Shopping/ Ct Comercial
14                   Loja/Salão
15        Loteamento/Condomínio
16                Pousada/Chalé
17               Prédio Inteiro
18                    Quitinete
19                       Studio
20                        Sítio
21               Terreno Padrão

In [42]:
tipos.columns

Index(['Tipo'], dtype='object', name='Id')